[
    {
    "Title": "The Wedding People",
    "Author": "Alison Espach",
    "Summary": "It's a beautiful day in Newport, Rhode Island, when Phoebe Stone arrives at the grand Cornwall Inn wearing a green dress and gold heels, not a bag in sight, alone. She's immediately mistaken by everyone in the lobby for one of the wedding people, but she's actually the only guest at the Cornwall who isn't here for the big event. Phoebe is here because she's dreamed of coming for years—she hoped to shuck oysters and take sunset sails with her husband, only now she's here without him, at rock bottom, and determined to have one last decadent splurge on herself. Meanwhile, the bride has accounted for every detail and every possible disaster the weekend might yield except for, well, Phoebe and Phoebe's plan—which makes it that much more surprising when the two women can't stop confiding in each other.\nIn turns absurdly funny and devastatingly tender, Alison Espach's The Wedding People is ultimately an incredibly nuanced and resonant look at the winding paths we can take to places we never imagined—and the chance encounters it sometimes takes to reroute us.",
    "PictureUrl": "/images/books/198902277.jpg",
    "Category": "Fiction",
    "Rating": 4.09,
    "Price": 24.99,
    "QuantityInStock": 17
    },
    {
    "Title": "The God of the Woods",
    "Author": "Liz Moore",
    "Summary": "Early morning, August 1975: a camp counselor discovers an empty bunk. Its occupant, Barbara Van Laar, has gone missing. Barbara isn't just any thirteen-year-old: she's the daughter of the family that owns the summer camp and employs most of the region's residents. And this isn't the first time a Van Laar child has disappeared. Barbara's older brother similarly vanished fourteen years ago, never to be found.\nAs a panicked search begins, a thrilling drama unfolds. Chasing down the layered secrets of the Van Laar family and the blue-collar community working in its shadow, Moore's multi-threaded story invites readers into a rich and gripping dynasty of secrets and second chances.\nLiz Moore's most ambitious and wide-reaching novel yet, The God of the Woods is a story of inheritance and second chances, the tensions between a family and a community, and a history that will not let any of them go.",
    "PictureUrl": "/images/books/199700434.jpg",
    "Category": "Mystery & Thriller",
    "Rating": 4.60,
    "Price": 19.99,
    "QuantityInStock": 12
    },
    {
    "Title": "Funny Story",
    "Author": "Emily Henry",
    "Summary": "Daphne always loved the way her fiancé, Peter, told their story. How they met (on a blustery day), fell in love (over an errant hat), and moved back to his lakeside hometown to begin their life together. He really was good at telling it... right up until the moment he realized he was actually in love with his childhood best friend Petra.\nWhich is how Daphne begins her new story: stranded in beautiful Waning Bay, Michigan, without friends or family but with a dream job as a children's librarian (that barely pays the bills), and proposing to be roommates with the only person who could possibly understand her predicament: Petra's ex, Miles Nowak.\nScruffy and chaotic—with a penchant for taking solace in the sounds of heart break love ballads—Miles is exactly the opposite of practical, buttoned-up Daphne, whose coworkers know so little about her they have a running bet that she's either FBI or in witness protection. The roommates mainly avoid one another, until one day, while drowning their sorrows, they form a tenuous friendship and a plan. If said plan also involves posting deliberately misleading photos of their summer adventures together, well, who could blame them?\nBut it's all just for show, of course, because there's no way Daphne would actually start her new chapter by falling in love with her ex-fiancé's new fiancée's ex... right?",
    "PictureUrl": "/images/books/194803835.jpg",
    "Category": "Romance",
    "Rating": 4.19,
    "Price": 11.99,
    "QuantityInStock": 4
    },
    {
    "Title": "House of Flame and Shadow",
    "Author": "Sarah J. Maas",
    "Summary": "The stunning third book in the sexy, action-packed Crescent City series, following the global bestsellers House of Earth and Blood and House of Sky and Breath.\nBryce Quinlan never expected to see a world other than Midgard, but now that she has, all she wants is to get back. Everything she loves is in Midgard: her family, her friends, her mate. Stranded in a strange new world, she's going to need all her wits about her to get home again. And that's no easy feat when she has no idea who to trust.\nHunt Athalar has found himself in some deep holes in his life, but this one might be the deepest of all. After a few brief months with everything he ever wanted, he's in the Asteri's dungeons again, stripped of his freedom and without a clue as to Bryce's fate. He's desperate to help her, but until he can escape the Asteri's leash, his hands are quite literally tied.\nIn this sexy, breathtaking sequel to the #1 bestsellers House of Earth and Blood and House of Sky and Breath, Sarah J. Maas's Crescent City series reaches new heights as Bryce and Hunt's world is brought to the brink of collapse-with its future resting on their shoulders.",
    "PictureUrl": "/images/books/123211531.jpg",
    "Category": "Romantasy",
    "Rating": 4.22,
    "Price": 14.99,
    "QuantityInStock": 25
    },
    {
    "Title": "Somewhere Beyond the Sea",
    "Author": "T.J. Klune",
    "Summary": "A magical house. A secret past. A summons that could change everything.\nArthur Parnassus lives a good life built on the ashes of a bad one.\nHe's the master of a strange orphanage on a distant and peculiar island, and he hopes to soon be the adoptive father to the six dangerous and magical children who live there.\nArthur works hard and loves with his whole heart so none of the children ever feel the neglect and pain that he once felt as an orphan on that very same island so long ago. He is not alone: joining him is the love of his life, Linus Baker, a former caseworker in the Department In Charge of Magical Youth. And there's the island's sprite, Zoe Chapelwhite, and her girlfriend, Mayor Helen Webb. Together, they will do anything to protect the children.\nBut when Arthur is summoned to make a public statement about his dark past, he finds himself at the helm of a fight for the future that his family, and all magical people, deserve.\nAnd when a new magical child hopes to join them on their island home—one who finds power in calling himself monster, a name that Arthur worked so hard to protect his children from—Arthur knows they're at a breaking point: their family will either grow stronger than ever or fall apart.\nWelcome back to Marsyas Island. This is Arthur's story.\nSomewhere Beyond the Sea is a story of resistance, lovingly told, about the daunting experience of fighting for the life you want to live and doing the work to keep it.",
    "PictureUrl": "/images/books/199347538.jpg",
    "Category": "Fantasy",
    "Rating": 4.13,
    "Price": 19.99,
    "QuantityInStock": 14
    },
    {
    "Title": "The Ministry of Time",
    "Author": "Kaliane Bradley",
    "Summary": "In the near future, a civil servant is offered the salary of her dreams and is, shortly afterward, told what project she'll be working on. A recently established government ministry is gathering 'expats” from across history to establish whether time travel is feasible—for the body, but also for the fabric of space-time.\nShe is tasked with working as a 'bridge”: living with, assisting, and monitoring the expat known as '1847” or Commander Graham Gore. As far as history is concerned, Commander Gore died on Sir John Franklin's doomed 1845 expedition to the Arctic, so he's a little disoriented to be living with an unmarried woman who regularly shows her calves, surrounded by outlandish concepts such as 'washing machines,” 'Spotify,” and 'the collapse of the British Empire.” But with an appetite for discovery, a seven-a-day cigarette habit, and the support of a charming and chaotic cast of fellow expats, he soon adjusts.\nOver the next year, what the bridge initially thought would be, at best, a horrifically uncomfortable roommate dynamic, evolves into something much deeper. By the time the true shape of the Ministry's project comes to light, the bridge has fallen haphazardly, fervently in love, with consequences she never could have imagined. Forced to confront the choices that brought them together, the bridge must finally reckon with how—and whether she believes—what she does next can change the future.\nAn exquisitely original and feverishly fun fusion of genres and ideas, The Ministry of Time asks: What does it mean to defy history, when history is living in your house? Kaliane Bradley's answer is a blazing, unforgettable testament to what we owe each other in a changing world.",
    "PictureUrl": "/images/books/199798179.jpg",
    "Category": "Science Fiction",
    "Rating": 3.58,
    "Price": 14.99,
    "QuantityInStock": 23
    },
    {
    "Title": "You Like It Darker",
    "Author": "Stephen King",
    "Summary": "'You like it darker? Fine, so do I' writes Stephen King in the afterword to this magnificent new collection of stories that delve into the darker part of life - both metaphorical and literal.\nEach of these stories holds its own thrills, joys and mysteries; each feels iconic. In 'Danny Coughlin's Bad Dream', a brief and unprecedented psychic flash upends dozens of lives, Danny's most catastrophically. 'Rattlesnakes', a sequel to Cujo, sees a grieving widower travel to Florida for respite and instead receive an unexpected inheritance—with major strings attached. 'The Answer Man' asks if prescience is good luck or bad and reminds us that a life marked by unbearable tragedy can still be meaningful.\nKing writes to feel 'the exhilaration of leaving ordinary day-to-day life behind' and his ability to surprise, amaze and bring us both terror and solace remains unsurpassed.\nYou like it darker? You got it.\n** With a bonus story for the paperback edition. **",
    "PictureUrl": "/images/books/201242757.jpg",
    "Category": "Horror",
    "Rating": 4.20,
    "Price": 29.99,
    "QuantityInStock": 31
    },
    {
    "Title": "How to End a Love Story",
    "Author": "Yulin Kuang",
    "Summary": "Helen Zhang hasn't seen Grant Shepard once in the thirteen years since the tragic accident that bound their lives together forever.\nNow a bestselling Author, Helen pours everything into her career. She's even scored a coveted spot in the writers' room of the TV adaptation of her popular young adult novels, and if she can hide her imposter syndrome and overcome her writer's block, surely the rest of her life will fall into place too. LA is the fresh start she needs. After all, no one knows her there. Except…\nGrant has done everything in his power to move on from the past, including building a life across the country. And while the panic attacks have never quite gone away, he's well liked around town as a screenwriter. He knows he shouldn't have taken the job on Helen's show, but it will open doors to developing his own projects that he just can't pass up.\nGrant's exactly as Helen remembers him—charming, funny, popular, and lovable in ways that she's never been. And Helen's exactly as Grant remembers too—brilliant, beautiful, closed off. But working together is messy, and electrifying, and Helen's parents, who have never forgiven Grant, have no idea he's in the picture at all.\nWhen secrets come to light, they must reckon with the fact that theirs was never meant to be any kind of love story. And yet… the key to making peace with their past—and themselves—might just lie in holding on to each other in the present.",
    "PictureUrl": "/images/books/212432167.jpg",
    "Category": "Debut Novel",
    "Rating": 3.62,
    "Price": 17.99,
    "QuantityInStock": 7
    },
    {
    "Title": "Ruthless Vows",
    "Author": "Rebecca Ross",
    "Summary": "Two weeks have passed since Iris returned home bruised and heartbroken from the front, but the war is far from over.\nRoman is missing, lost behind enemy lines, with no memory of his past, or Iris. Hoping his memories return, he begins to write again – but this time for the enemy.\nWhen a strange letter arrives through his wardrobe door, he strikes up a correspondence with a penpal who seems at once mysterious… and strangely familiar.\nAs their connection deepens, the two of them will risk their very hearts and futures to change the tides of the war.",
    "PictureUrl": "/images/books/127280062.jpg",
    "Category": "Adult Fantasy",
    "Rating": 3.99,
    "Price": 14.99,
    "QuantityInStock": 11
    },
    {
    "Title": "Heartstopper: Volume Five",
    "Author": "Alice Oseman",
    "Summary": "Nick and Charlie are very much in love. They've finally said those three little words, and Charlie has almost persuaded his mum to let him sleep over at Nick's house... but with Nick going off to university next year, is everything about to change?\nBy Alice Oseman, winner of the YA Book Prize, Heartstopper encompasses all the small moments of Nick and Charlie's lives that together make up something larger, which speaks to all of us.",
    "PictureUrl": "/images/books/125045190.jpg",
    "Category": "Young Adult Fiction",
    "Rating": 4.46,
    "Price": 34.99,
    "QuantityInStock": 15
    },
    {
    "Title": "The Anxious Generation: How the Great Rewiring of Childhood Caused an Epidemic of Mental Illness",
    "Author": "Jonathan Haidt",
    "Summary": "THE INSTANT #1 NEW YORK TIMES BESTSELLER • A Wall Street Journal Top 10 Book of 2024 • A Washington Post Notable Book • A New York Times Notable Book • The Goodreads Choice Award Nonfiction Book of the Year\nA must-read for all parents: the generation-defining investigation into the collapse of youth mental health in the era of smartphones, social media, and big tech—and a plan for a healthier, freer childhood.\n'With tenacity and candor, Haidt lays out the consequences that have come with allowing kids to drift further into the virtual world . . . While also offering suggestions and solutions that could help protect a new generation of kids.” —Shannon Carlin, ,i>TIME, 100 Must-Read Books of 2024\nAfter more than a decade of stability or improvement, the mental health of adolescents plunged in the early 2010s. Rates of depression, anxiety, self-harm, and suicide rose sharply, more than doubling on many measures. Why?\nIn The Anxious Generation, social psychologist Jonathan Haidt lays out the facts about the epidemic of teen mental illness that hit many countries at the same time. He then investigates the nature of childhood, including why children need play and independent exploration to mature into competent, thriving adults. Haidt shows how the 'play-based childhood” began to decline in the 1980s, and how it was finally wiped out by the arrival of the 'phone-based childhood” in the early 2010s. He presents more than a dozen mechanisms by which this 'great rewiring of childhood” has interfered with children's social and neurological development, covering everything from sleep deprivation to attention fragmentation, addiction, loneliness, social contagion, social comparison, and perfectionism. He explains why social media damages girls more than boys and why boys have been withdrawing from the real world into the virtual world, with disastrous consequences for themselves, their families, and their societies.\nMost important, Haidt issues a clear call to action. He diagnoses the 'collective action problems” that trap us, and then proposes four simple rules that might set us free. He describes steps that parents, teachers, schools, tech companies, and governments can take to end the epidemic of mental illness and restore a more humane childhood.\nHaidt has spent his career speaking truth backed by data in the most difficult landscapes—communities polarized by politics and religion, campuses battling culture wars, and now the public health emergency faced by Gen Z. We cannot afford to ignore his findings about protecting our children—and ourselves—from the psychological damage of a phone-based life.",
    "PictureUrl": "/images/books/171681821.jpg",
    "Category": "Nonfiction",
    "Rating": 4.33,
    "Price": 16.99,
    "QuantityInStock": 31
    },
    {
    "Title": "The Third Gilmore Girl: A Memoir",
    "Author": "Kelly Bishop",
    "Summary": "After more than a half century in show business, Kelly Bishop has stories to tell.\nFrom her Tony Award-winning performance in the original Broadway cast of A Chorus Line, to playing Jennifer Grey's mother in Dirty Dancing, to her iconic role as matriarch Emily Gilmore in the groundbreaking television classic Gilmore Girls, few actors have enjoyed such long-running success—and even fewer can claim the adoration that this legendary actress has cultivated over her many working years. Kelly's instantly recognizable voice has echoed through theaters and living rooms for decades.\nFor the first time, Kelly opens the door into her own life. She retraces her steps from Broadway to Hollywood and everywhere in between, reflecting on her decades-long career and sharing some of her greatest memories and the lessons she learned along the way. From her early days as a dancer at Radio City Music Hall in the '60s, to marrying young to a compulsive gambler, to her time as a burned-out Las Vegas showgirl, nothing is off-limits. She takes readers behind the scenes, from how she helped create a role in A Chorus Line, what it was like having Ed Herrmann as her TV husband and Lauren Graham as her TV daughter, and working with some of the biggest names in showbiz. The result is an enchanting celebration of a fearless and versatile performer whose talent and spirit have earned her an enduring place in the hearts and homes of millions.\nChock-full of witty insights and personal photographs, The Third Gilmore Girl is a warm, unapologetic, lively memoir from a woman who has left indelible impressions on her audiences—and who has no plans of slowing down.",
    "PictureUrl": "/images/books/207298106.jpg",
    "Category": "Memoir",
    "Rating": 4.33,
    "Price": 15.99,
    "QuantityInStock": 9
    },
    {
    "Title": "The Bookshop: A History of the American Bookstore",
    "Author": "Evan Friss",
    "Summary": "Bookstores have always been unlike any other kind of store, shaping readers and writers, and influencing our tastes, thoughts, and politics. They nurture local communities while creating new ones of their own. Bookshops are powerful spaces, but they are also endangered ones. In The Bookshop, we see those stakes: what has been, and what might be lost.\nEvan Friss's history of the bookshop draws on oral histories, archival collections, municipal records, diaries, letters, and interviews with leading booksellers to offer a fascinating look at this institution beloved by so many. The story begins with Benjamin Franklin's first bookstore in Philadelphia and takes us to a range of booksellers including The Strand, Chicago's Marshall Field & Company, Gotham Book Mart, specialty stores like Oscar Wilde and Drum and Spear, sidewalk sellers of used books, Barnes & Noble, Amazon Books, and Parnassus. The Bookshop is also a history of the leading figures in American bookselling, often impassioned eccentrics, and a history of how books have been marketed and sold over more than two centuries—including, for example, a 3,000-pound elephant who appeared to sign books at Marshall Field's in 1944.\nThe Bookshop is a love letter to bookstores, a charming chronicle for anyone who cherishes these sanctuaries of literature, and essential reading to understand how these vital institutions have shaped American life—and why we still need them.",
    "PictureUrl": "/images/books/201751300.jpg",
    "Category": "History & Biography",
    "Rating": 3.91,
    "Price": 24.99,
    "QuantityInStock": 42
    }
]